using ConsoleApp;
using System.Collections.Generic;

public class KHLTeamNames : ITeamNames
{
	public List<string> Names => new List<string>
		{
        // Западная конференция
        "ЦСКА",
		"СКА",
		"Динамо Москва",
		"Динамо Минск",
		"Локомотив",
		"Спартак",
		"Северсталь",
		"Сочи",
		"Торпедо",
		"Шанхайские драконы",
		"Лада",

        // Восточная конференция
        "Ак Барс",
		"Салават Юлаев",
		"Металлург",
		"Автомобилист",
		"Авангард",
		"Трактор",
		"Барыс",
		"Сибирь",
		"Нефтехимик",
		"Амур",
		"Адмирал",
	};
}