using ConsoleApp;
using System.Collections.Generic;

public class NHLTeamsNames : ITeamNames
{
	public List<string> Names => new List<string> {
        // Западная конференция
        "Колорадо",
		"Даллас",
		"Миннесота",
		"Вегас",
		"Эдмонтон",
		"Юта Маммот",
		"Анахайм",
		"Лос-Анджелес",
		"Сан-Хосе",
		"Сент-Луис",
		"Нэшвилл",
		"Виннипег",
		"Сиэтл",
		"Калгари",
		"Чикаго",
		"Ванкувер",

        // Восточная конференция
        "Каролина",
		"Баффало",
		"Тампа-Бэй",
		"Монреаль",
		"Бостон",
		"Оттава",
		"Питтсбург",
		"Филадельфия",
		"Вашингтон",
		"Детройт",
		"Коламбус",
		"Айлендерс",
		"Нью-Джерси",
		"Флорида",
		"Торонто",
		"Рейнджерс"
	};
}