using ConsoleApp.Teams;
using System.Collections.Generic;

public class KHLTeamNames : ITeamsData
{
	public List<(string, string, int)> Data => new()
	{
        // Западная конференция
        ("ЦСКА", "Москва", 1),
		("СКА", "Санкт-Петербург", 2),
		("Динамо Москва", "Москва", 3),
		("Динамо Минск", "Минск", 4),
		("Локомотив", "Ярославль", 5),
		("Спартак", "Москва", 6),
		("Северсталь", "Череповец", 7),
		("Сочи", "Сочи", 8 ),
		("Торпедо", "Нижний Новгород", 9),
		("Шанхайские драконы", "Шанхай", 10),
		("Лада", "Тольятти", 11),

        // Восточная конференция
        ("Ак Барс", "Казань", 12),
		("Салават Юлаев", "Уфа", 13),
		("Металлург", "Магнитогорск", 14),
		("Автомобилист", "Екатеринбург", 15),
		("Авангард", "Омск", 16),
		("Трактор", "Челябинск", 17),
		("Барыс", "Астана", 18),
		("Сибирь", "Новосибирск", 19),
		("Нефтехимик", "Нижнекамск", 20),
		("Амур", "Хабаровск", 21),
		("Адмирал", "Владивосток", 22)
	};
}