using ConsoleApp.Teams;
using System.Collections.Generic;

public class NHLTeamsNames : ITeamsData
{
	public List<(string, string, int)> Data => new()
	{
        // Западная конференция
        ("Колорадо", "Денвер", 0),
		("Даллас", "Даллас", 0),
		("Миннесота", "Сент-Пол", 0),
		("Вегас", "Парадайс", 0),
		("Эдмонтон", "Эдмонтон", 0),
		("Юта Маммот", "Солт-Лейк-Сити", 0),
		("Анахайм", "Анахайм", 0),
		("Лос-Анджелес", "Лос-Анджелес", 0),
		("Сан-Хосе", "Сан-Хосе", 0),
		("Сент-Луис", "Сент-Луис", 0),
		("Нэшвилл", "Нэшвилл", 0),
		("Виннипег", "Виннипег", 0),
		("Сиэтл", "Сиэтл", 0),
		("Калгари", "Калгари", 0),
		("Чикаго", "Чикаго", 0),
		("Ванкувер", "Ванкувер", 0),

        // Восточная конференция
        ("Каролина", "Роли", 0),
		("Баффало", "Баффало", 0),
		("Тампа-Бэй", "Тампа", 0),
		("Монреаль", "Монреаль", 0),
		("Бостон", "Бостон", 0),
		("Оттава", "Оттава", 0),
		("Питтсбург", "Питтсбург", 0),
		("Филадельфия", "Филадельфия", 0),
		("Вашингтон", "Вашингтон", 0),
		("Детройт", "Детройт", 0),
		("Коламбус", "Коламбус", 0),
		("Айлендерс", "Нью-Йорк", 0),
		("Нью-Джерси", "Ньюарк", 0),
		("Флорида", "Санрайз", 0),
		("Торонто", "Торонто", 0),
		("Рейнджерс", "Нью-Йорк", 0)
	};
}